In [4]:
import pandas as pd

In [5]:
#외부 라이브러리 설치
%pip install pandas

Requirement already satisfied: pandas in c:\users\seopa\appdata\local\programs\python\python311\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\seopa\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\seopa\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2022.7.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\seopa\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.1)
Requirement already satisfied: six>=1.5 in c:\users\seopa\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
%pip install upgrade pip

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement upgrade (from versions: none)
ERROR: No matching distribution found for upgrade

In [7]:
#스리즈 형태의 데이터를 생성
#pd.Series()

pd_list=pd.Series([5000,6000,6500,6500], index=['아메리카노','카페라떼','카페모카','카푸치노'])

In [8]:
print(pd_list)

아메리카노    5000
카페라떼     6000
카페모카     6500
카푸치노     6500
dtype: int64

In [9]:
#스리즈 형태의 데이터에서 values 값과 index 값을 따로 출력이 가능

print('스리즈의 value=', pd_list.values)
print('스리즈의 index=', pd_list.index)

스리즈의 value= [5000 6000 6500 6500]
스리즈의 index= Index(['아메리카노', '카페라떼', '카페모카', '카푸치노'], dtype='object')

In [10]:
#데이터프레임 형태의 데이터 생성

_value=[[1,2,3],[4,5,6],[7,8,9]]
_index=['a','b','c']
_column=['A','B','C']

pd_df=pd.DataFrame(_value, index=_index, columns= _column)

print(pd_df)

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [11]:
pd_df

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [12]:
#데이터프레임의 value, index, column의 값을 출력

print('데이터프레임의 value=',pd_df.values)
print('데이터프레임의 index=',pd_df.index)
print('데이터프레임의 column=',pd_df.columns)

데이터프레임의 value= [[1 2 3]
 [4 5 6]
 [7 8 9]]
데이터프레임의 index= Index(['a', 'b', 'c'], dtype='object')
데이터프레임의 column= Index(['A', 'B', 'C'], dtype='object')

In [13]:
#딕셔너리 형태의 데이터를 데이터프레임의 형태로 변경

_values= {'name':['A','B','C'], 'age':[20,30,40], 'phone':['01012345678','01056789876','01023452342']}

print(_values['name'])

['A', 'B', 'C']

In [14]:
pd_df_2=pd.DataFrame(_values)
pd_df_2

  name  age        phone
0    A   20  01012345678
1    B   30  01056789876
2    C   40  01023452342

In [15]:
#상단의 행을 기준으로 출력을 하는 head(n)
#상단부터 n번째까지 출력하는 함수

pd_df_2.head()

  name  age        phone
0    A   20  01012345678
1    B   30  01056789876
2    C   40  01023452342

In [16]:
#하단부터 n번째까지 출력하는 함수 ->tail()

pd_df_2.tail(2)

  name  age        phone
1    B   30  01056789876
2    C   40  01023452342

In [17]:
#컬럼을 기준으로 출력하는 방법 -> 스리즈 형태 -> 데이터프레임 형태로 바꾸는건 소괄호를 하나 더 넣는다

pd_df_2['age']

0    20
1    30
2    40
Name: age, dtype: int64

In [18]:
pd_df_2[['age']]

   age
0   20
1   30
2   40

In [19]:
#pandas를 이용해서 외부파일을 로드
#csv파일을 로드 -> read_csv(파일명)

df=pd.read_csv('example.csv')
df

  Name  Gender          Phone
0    A    male  010-1234-5678
1    B  female  010-1234-5679
2    C    male  010-1234-5680
3    D  female  010-1234-5681
4    E    male  010-1234-5682
5    F  female  010-1234-5683
6    G    male  010-1234-5684
7    H  female  010-1234-5685
8    I    male  010-1234-5686
9    J  female  010-1234-5687

#경로 지정
1. 절대 경로
- 절대적인 주소
- ex) c:/users/administrator/a.txt, 인터넷 URL
2. 상대 경로
- 상대적인 주소
- './' -> 현재 작업중인 폴더
- '../' -> 상위 폴더로 이동
- './폴더명/' -> 하위 폴더로 이동

In [20]:
#상위 폴더에 있는 csv 폴더로 이동해서 example.csv 파일 pandas를 이용하여 로드

df2=pd.read_csv('../csv/example.csv')
df2

  Name  Gender          Phone
0    A    male  010-1234-5678
1    B  female  010-1234-5679
2    C    male  010-1234-5680
3    D  female  010-1234-5681
4    E    male  010-1234-5682
5    F  female  010-1234-5683
6    G    male  010-1234-5684
7    H  female  010-1234-5685
8    I    male  010-1234-5686
9    J  female  010-1234-5687

In [21]:
#상위 폴더로 이동해서 csv 폴더에 num_2폴더안에 있는 drinks.csv 파일 로드

df4=pd.read_csv('../csv/num_2/drinks.csv')
df4

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [22]:
%pip install numpy

Requirement already satisfied: numpy in c:\users\seopa\appdata\local\programs\python\python311\lib\site-packages (1.24.1)
Note: you may need to restart the kernel to use updated packages.

In [23]:
%pip install matplotlib

Collecting matplotlib
  Downloading matplotlib-3.6.3-cp311-cp311-win_amd64.whl (7.2 MB)
     ---------------------------------------- 7.2/7.2 MB 4.0 MB/s eta 0:00:00
Collecting contourpy>=1.0.1
  Downloading contourpy-1.0.7-cp311-cp311-win_amd64.whl (162 kB)
     ------------------------------------ 163.0/163.0 kB 425.4 kB/s eta 0:00:00
Collecting cycler>=0.10
  Using cached cycler-0.11.0-py3-none-any.whl (6.4 kB)
Collecting fonttools>=4.22.0
  Using cached fonttools-4.38.0-py3-none-any.whl (965 kB)
Collecting kiwisolver>=1.0.1
  Downloading kiwisolver-1.4.4-cp311-cp311-win_amd64.whl (55 kB)
     -------------------------------------- 55.4/55.4 kB 960.7 kB/s eta 0:00:00
Requirement already satisfied: numpy>=1.19 in c:\users\seopa\appdata\local\programs\python\python311\lib\site-packages (from matplotlib) (1.24.1)
Requirement already satisfied: packaging>=20.0 in c:\users\seopa\appdata\local\programs\python\python311\lib\site-packages (from matplotlib) (23.0)
Collecting pillow>=6.2.0
  Downloading Pillow-9.4.0-cp311-cp311-win_amd64.whl (2.5 MB)
     ---------------------------------------- 2.5/2.5 MB 3.3 MB/s eta 0:00:00
Collecting pyparsing>=2.2.1
  Using cached pyparsing-3.0.9-py3-none-any.whl (98 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\seopa\appdata\local\programs\python\python311\lib\site-packages (from matplotlib) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\seopa\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib
Successfully installed contourpy-1.0.7 cycler-0.11.0 fonttools-4.38.0 kiwisolver-1.4.4 matplotlib-3.6.3 pillow-9.4.0 pyparsing-3.0.9
Note: you may need to restart the kernel to use updated packages.